#Напишите программу, которая выводит такое «окно» на экран.

#Первый вариант
# ==============================
# Привет
# друг
# ==============================

# Второй вариант
# ==============================
# ||        Привет            ||
# ||         друг             ||
# ==============================

#Третий вариант
print('Задание 2')
print('==============================')
print('||                          ||')
print('||                          ||')
print('||          Привет,         ||')
print('||          Андрей!         ||')
print('||                          ||')
print('||                          ||')
print('==============================')


#Размер окна может быть любым, 
#вместо слова «друг» можете написать своё имя.
#Постарайтесь добиться результата из третьего варианта.
